## production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                     |
|----------|-----------------------------------------------------------------------------|
| add      | `aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]`             |
|          | `aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]`               |
|          | `aws_cloudwatch_query_definition.api_gateway_average_latency[0]`            |
|          | `aws_cloudwatch_query_definition.api_gateway_errors_by_ip_address[0]`       |
|          | `aws_cloudwatch_query_definition.api_lambda_concurrent_running_per_min[0]`  |
|          | `aws_cloudwatch_query_definition.api_lambda_gunicorn_total_running_time[0]` |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
13:52:43.642 STDOUT terraform:   + create
13:52:43.642 STDOUT terraform: -/+ destroy and then create replacement
13:52:43.642 STDOUT terraform: Terraform will perform the following actions:
13:52:43.642 STDOUT terraform:   # aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0] will be created
13:52:43.642 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "api-gateway-5xx-error-critical" {
13:52:43.642 STDOUT terraform:       + actions_enabled                       = true
13:52:43.642 STDOUT terraform:       + alarm_actions                         = [
13:52:43.642 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
13:52:43.642 STDOUT terraform:         ]
13:52:43.642 STDOUT terraform:       + alarm_description                     = "API Gateway is returning 5XX errors"
13:52:43.642 STDOUT terraform:       + alarm_name                            = "api-gateway-5xx-error-critical"
13:52:43.642 STDOUT terraform:       + arn                                   = (known after apply)
13:52:43.642 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
13:52:43.642 STDOUT terraform:       + dimensions                            = {
13:52:43.642 STDOUT terraform:           + "ApiName" = "api-lambda"
13:52:43.643 STDOUT terraform:           + "Stage"   = "v1"
13:52:43.643 STDOUT terraform:         }
13:52:43.643 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
13:52:43.643 STDOUT terraform:       + evaluation_periods                    = 1
13:52:43.643 STDOUT terraform:       + id                                    = (known after apply)
13:52:43.643 STDOUT terraform:       + insufficient_data_actions             = [
13:52:43.643 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
13:52:43.643 STDOUT terraform:         ]
13:52:43.643 STDOUT terraform:       + metric_name                           = "5XXError"
13:52:43.643 STDOUT terraform:       + namespace                             = "AWS/ApiGateway"
13:52:43.643 STDOUT terraform:       + ok_actions                            = [
13:52:43.643 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
13:52:43.643 STDOUT terraform:         ]
13:52:43.643 STDOUT terraform:       + period                                = 60
13:52:43.643 STDOUT terraform:       + region                                = "ca-central-1"
13:52:43.643 STDOUT terraform:       + statistic                             = "Sum"
13:52:43.643 STDOUT terraform:       + tags_all                              = (known after apply)
13:52:43.643 STDOUT terraform:       + threshold                             = 10
13:52:43.643 STDOUT terraform:       + treat_missing_data                    = "notBreaching"
13:52:43.643 STDOUT terraform:     }
13:52:43.643 STDOUT terraform:   # aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0] will be created
13:52:43.643 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "lambda-api-throttle-critical" {
13:52:43.643 STDOUT terraform:       + actions_enabled                       = true
13:52:43.643 STDOUT terraform:       + alarm_actions                         = [
13:52:43.643 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
13:52:43.643 STDOUT terraform:         ]
13:52:43.643 STDOUT terraform:       + alarm_description                     = "API Lambda function is being throttled"
13:52:43.643 STDOUT terraform:       + alarm_name                            = "lambda-api-throttle-critical"
13:52:43.644 STDOUT terraform:       + arn                                   = (known after apply)
13:52:43.644 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
13:52:43.644 STDOUT terraform:       + dimensions                            = {
13:52:43.644 STDOUT terraform:           + "FunctionName" = "api-lambda"
13:52:43.644 STDOUT terraform:         }
13:52:43.644 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
13:52:43.644 STDOUT terraform:       + evaluation_periods                    = 1
13:52:43.644 STDOUT terraform:       + id                                    = (known after apply)
13:52:43.644 STDOUT terraform:       + insufficient_data_actions             = [
13:52:43.644 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
13:52:43.644 STDOUT terraform:         ]
13:52:43.644 STDOUT terraform:       + metric_name                           = "Throttles"
13:52:43.644 STDOUT terraform:       + namespace                             = "AWS/Lambda"
13:52:43.644 STDOUT terraform:       + ok_actions                            = [
13:52:43.644 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
13:52:43.644 STDOUT terraform:         ]
13:52:43.644 STDOUT terraform:       + period                                = 60
13:52:43.644 STDOUT terraform:       + region                                = "ca-central-1"
13:52:43.644 STDOUT terraform:       + statistic                             = "Sum"
13:52:43.644 STDOUT terraform:       + tags_all                              = (known after apply)
13:52:43.644 STDOUT terraform:       + threshold                             = 10
13:52:43.644 STDOUT terraform:       + treat_missing_data                    = "notBreaching"
13:52:43.644 STDOUT terraform:     }
13:52:43.644 STDOUT terraform:   # aws_cloudwatch_query_definition.api_gateway_average_latency[0] will be created
13:52:43.644 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_gateway_average_latency" {
13:52:43.644 STDOUT terraform:       + id                  = (known after apply)
13:52:43.644 STDOUT terraform:       + log_group_names     = [
13:52:43.644 STDOUT terraform:           + "api_gateway_log_group",
13:52:43.644 STDOUT terraform:         ]
13:52:43.644 STDOUT terraform:       + name                = "API Gateway / Average Latency from API Gateway"
13:52:43.644 STDOUT terraform:       + query_definition_id = (known after apply)
13:52:43.644 STDOUT terraform:       + query_string        = <<-EOT
13:52:43.644 STDOUT terraform:             fields @timestamp, @message
13:52:43.644 STDOUT terraform:             | parse @message '"resourcePath":"*"' as resourcePath
13:52:43.645 STDOUT terraform:             | parse @message '"responseLatency":"*"' as responseLatency
13:52:43.645 STDOUT terraform:             | stats 
13:52:43.645 STDOUT terraform:                 count() as requests,
13:52:43.645 STDOUT terraform:                 avg(responseLatency) as avgLatency,
13:52:43.645 STDOUT terraform:                 pct(responseLatency, 95) as p95Latency,
13:52:43.645 STDOUT terraform:                 max(responseLatency) as maxLatency
13:52:43.645 STDOUT terraform:                 by resourcePath,
13:52:43.645 STDOUT terraform:                    if(responseLatency < 400, "under 400ms",
13:52:43.645 STDOUT terraform:                       if(responseLatency < 1000, "400ms - 1s", "over 1s")
13:52:43.645 STDOUT terraform:                    ) as latencyBucket
13:52:43.645 STDOUT terraform:             | sort avgLatency desc
13:52:43.645 STDOUT terraform:         EOT
13:52:43.645 STDOUT terraform:       + region              = "ca-central-1"
13:52:43.645 STDOUT terraform:     }
13:52:43.645 STDOUT terraform:   # aws_cloudwatch_query_definition.api_gateway_errors_by_ip_address[0] will be created
13:52:43.645 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_gateway_errors_by_ip_address" {
13:52:43.645 STDOUT terraform:       + id                  = (known after apply)
13:52:43.645 STDOUT terraform:       + log_group_names     = [
13:52:43.645 STDOUT terraform:           + "api_gateway_log_group",
13:52:43.645 STDOUT terraform:         ]
13:52:43.645 STDOUT terraform:       + name                = "API Gateway / API Gateway error by IP address"
13:52:43.645 STDOUT terraform:       + query_definition_id = (known after apply)
13:52:43.645 STDOUT terraform:       + query_string        = <<-EOT
13:52:43.645 STDOUT terraform:             fields @timestamp, @message, @logStream, status
13:52:43.645 STDOUT terraform:             | filter status = "500"
13:52:43.645 STDOUT terraform:             | stats count() as total by ip
13:52:43.645 STDOUT terraform:             | order by total desc
13:52:43.645 STDOUT terraform:             | limit 1000
13:52:43.645 STDOUT terraform:         EOT
13:52:43.645 STDOUT terraform:       + region              = "ca-central-1"
13:52:43.645 STDOUT terraform:     }
13:52:43.645 STDOUT terraform:   # aws_cloudwatch_query_definition.api_lambda_concurrent_running_per_min[0] will be created
13:52:43.645 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_lambda_concurrent_running_per_min" {
13:52:43.645 STDOUT terraform:       + id                  = (known after apply)
13:52:43.645 STDOUT terraform:       + log_group_names     = [
13:52:43.645 STDOUT terraform:           + "/aws/lambda/api-lambda",
13:52:43.645 STDOUT terraform:         ]
13:52:43.646 STDOUT terraform:       + name                = "API / Concurrent API-Lambdas running per min"
13:52:43.646 STDOUT terraform:       + query_definition_id = (known after apply)
13:52:43.646 STDOUT terraform:       + query_string        = <<-EOT
13:52:43.646 STDOUT terraform:             fields @timestamp, @message
13:52:43.646 STDOUT terraform:             | parse @message /START RequestId: (?<requestId>[\w-]+)/
13:52:43.646 STDOUT terraform:             | stats count() as concurrent by bin(1m)
13:52:43.646 STDOUT terraform:             | sort concurrent desc
13:52:43.646 STDOUT terraform:         EOT
13:52:43.646 STDOUT terraform:       + region              = "ca-central-1"
13:52:43.646 STDOUT terraform:     }
13:52:43.646 STDOUT terraform:   # aws_cloudwatch_query_definition.api_lambda_gunicorn_total_running_time[0] will be created
13:52:43.646 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "api_lambda_gunicorn_total_running_time" {
13:52:43.646 STDOUT terraform:       + id                  = (known after apply)
13:52:43.646 STDOUT terraform:       + log_group_names     = [
13:52:43.646 STDOUT terraform:           + "/aws/lambda/api-lambda",
13:52:43.646 STDOUT terraform:         ]
13:52:43.646 STDOUT terraform:       + name                = "API / Gunicorn total running time"
13:52:43.646 STDOUT terraform:       + query_definition_id = (known after apply)
13:52:43.646 STDOUT terraform:       + query_string        = <<-EOT
13:52:43.646 STDOUT terraform:             filter @message like /Total gunicorn running time/
13:52:43.646 STDOUT terraform:             | parse @message /Total gunicorn API running time: (?<@gunicorn_time>.*?) seconds/
13:52:43.646 STDOUT terraform:             | order by @timestamp asc
13:52:43.646 STDOUT terraform:             | display @timestamp, @gunicorn_time
13:52:43.646 STDOUT terraform:         EOT
13:52:43.646 STDOUT terraform:       + region              = "ca-central-1"
13:52:43.646 STDOUT terraform:     }
13:52:43.646 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
13:52:43.646 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
13:52:43.646 STDOUT terraform:       ~ id       = "2605502675254715627" -> (known after apply)
13:52:43.646 STDOUT terraform:       ~ triggers = { # forces replacement
13:52:43.646 STDOUT terraform:           ~ "always_run" = "2025-08-28T18:43:54Z" -> (known after apply)
13:52:43.646 STDOUT terraform:         }
13:52:43.646 STDOUT terraform:     }
13:52:43.646 STDOUT terraform: Plan: 7 to add, 0 to change, 1 to destroy.
13:52:43.646 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:52:43.647 STDOUT terraform: Saved the plan to: plan.tfplan
13:52:43.647 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:52:43.647 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
